dataset_gen/NS_datasets/FPO_external/Regular/Design_Point_0/0/U
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            fixedValue;
        value           nonuniform List<vector>
        (
            (0.0 0.0 0.0)
        );
    }
    right
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
